//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   RelateDetectCollition.h
//!
//! @brief  衝突判定関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 列挙体の定義 ============================================================




// データ型の定義 ==========================================================




// 定数の定義 ==============================================================




// グローバル変数の定義 ====================================================




// 関数の定義 ==============================================================

// 全ての当たり判定処理
void AllDetectCollision(void);

// 矩形同士の当たり判定
BOOL DetectCollisionBoxAndBox(float x1, float y1, float width1, float height1, float x2, float y2, float width2, float height2);

// 矩形と点の当たり判定
BOOL DetectCollisionBoxAndPoint(float boxX, float boxY, float width, float height, float pointX, float pointY);