//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Animation.cpp
//!
//! @brief  アニメーション関連のソースファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "RelateAnimation.h"



// データ型の定義 ==========================================================




// 定数の定義 ==============================================================




// グローバル変数の定義 ====================================================




// 関数のプロトタイプ宣言 ==================================================




// 関数の定義 ==============================================================
//----------------------------------------------------------------------
//! @brief アニメーションの更新処理
//!
//! @param[object] 更新するオブジェクト
//!
//! @return なし
//----------------------------------------------------------------------
void UpdataAnimation(Animation *animation)
{
	//ローカル変数の宣言//----------------------------------------------



	//ローカル変数の初期化//--------------------------------------------



	//処理の内容//------------------------------------------------------

	//アニメーションが使用中である
	if (animation->state == 1)
	{
		//時間をはかる
		animation->elapsedTime++;
		//現在の表示時間が終わった
		if (animation->elapsedTime > animation->frameDuration)
		{
			//次のフレームに移動
			animation->frameNum++;
			//表示時間のリセット
			animation->elapsedTime = 0;

			//全ての画像を表示した
			if (animation->frameNum == animation->numFrames)
			{
				//画像を元に戻す
				animation->frameNum = 0;
				//未使用にする
				animation->state = 0;
			}
		}
	}

}



//----------------------------------------------------------------------
//! @brief アニメーションのリセット処理
//!
//! @param[object] リセットするオブジェクト
//!
//! @return なし
//----------------------------------------------------------------------
void ResetAnimation(Animation *animation)
{
	//ローカル変数の宣言//----------------------------------------------



	//ローカル変数の初期化//--------------------------------------------



	//処理の内容//------------------------------------------------------

	//フレーム時間
	animation->elapsedTime = 0;

	//フレーム番号
	animation->frameNum = 0;

	//状態
	animation->state = 0;

}
