//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   RelateSpecial.h
//!
//! @brief  特殊能力関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// データ型の定義 ==========================================================





// 定数の定義 ==============================================================





// グローバル変数の定義 ====================================================

//飛行フラグ
extern BOOL g_flyFlag;



// 関数の宣言 ==============================================================

//特殊能力の使用
void UseSpecialPower(ObjectPlayer *player);

//飛行中の操作処理
void ManipulateFlyingPlayer(ObjectPlayer *player);
