//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   RelateEnemy.h
//!
//! @brief  敵関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// データ型の定義 ==========================================================





// 定数の定義 ==============================================================

//敵の最大数
#define MAX_ENEMY (100)

//敵のサイズ
#define ENEMY_SIZE (64)


// グローバル変数の定義 ====================================================

//敵
extern ObjectEnemy g_enemies[MAX_ENEMY];



// 関数の宣言 ==============================================================

// 敵の初期化処理
void InitializeEnemy(void);

// 敵の更新処理
void UpdateEnemy(void);

// 敵の描画処理
void RendarEnemy(void);
