//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   RelatePlayer.h
//!
//! @brief  プレイヤー関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 列挙体の定義 ============================================================




// データ型の定義 ==========================================================




// 定数の定義 ==============================================================

// <プレイヤーのサイズ> -----------------------------------------------
// サイズ
#define PLAYER_SIZE (64)

// 特殊能力の使用時間
#define TIME_SPECIAL (600)

// グローバル変数の定義 ====================================================

// <プレイヤー>
extern ObjectPlayer g_player;


// 関数の宣言 ==============================================================

//プレイヤーの初期化処理
void InitializePlayer(void);

//プレイヤーの更新処理
void UpdatePlayer(void);

//プレイヤーの描画処理
void RendarPlayer(void);
