//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   ScenePlaying.h
//!
//! @brief  プレイシーン関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// データ型の定義 ==========================================================





// 定数の定義 ==============================================================





// グローバル変数の定義 ====================================================
//サウンド
//SE
extern HSND g_playSE[17];


// 関数の宣言 ==============================================================

// プレイシーンの初期化処理
void InitializePlaying(void);

// プレイシーンの更新処理
void UpdatePlaying(void);

// プレイシーンの描画処理
void RenderPlaying(void);

// プレイシーンの終了処理
void FinalizePlaying(void);


