//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneTitle.h
//!
//! @brief  タイトルシーン関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// データ型の定義 ==========================================================





// 定数の定義 ==============================================================





// グローバル変数の定義 ====================================================





// 関数の宣言 ==============================================================

// タイトルシーンの初期化処理
void InitializeTitle(void);

// タイトルシーンの更新処理
void UpdateTitle(void);

// タイトルシーンの描画処理
void RenderTitle(void);

// タイトルシーンの終了処理
void FinalizeTitle(void);
