//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneSelect.h
//!
//! @brief  セレクトシーン関連のヘッダファイル
//!
//! @date   2017.10.01
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// データ型の定義 ==========================================================





// 定数の定義 ==============================================================





// グローバル変数の定義 ====================================================





// 関数の宣言 ==============================================================

// セレクトシーンの初期化処理
void InitializeSelect(void);

// セレクトシーンの更新処理
void UpdateSelect(void);

// セレクトシーンの描画処理
void RenderSelect(void);

// セレクトシーンの終了処理
void FinalizeSelect(void);